Tekla Open API Reference for Tekla Structures 2025
View.IsPerspectiveViewProjection Method
Tells whether the view projection is a perspective projection.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsPerspectiveViewProjection()
Public Function IsPerspectiveViewProjection As Boolean
Return Value
Type: Boolean
True if the view projection type is perspective projection.
See Also
Reference
View Class
Tekla.Structures.Model.UI Namespace